DataProcessors/ПроверкаЗаписейРегистраБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ПроверкаЗаписейРегистраБухгалтерии</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректироватьСтоимостьАвтоматически</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

ChartsOfAccounts/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<ChartOfAccounts>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ExtDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоХозрасчетные</ExtDimensionTypes>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьИспользоватьВПроводках</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБыстрогоВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>УчетПоПодразделениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<AccountingFlag>
				<Properties>
					<Name>НалоговыйУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</AccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Суммовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Валютный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
			<ExtDimensionAccountingFlag>
				<Properties>
					<Name>Количественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</ExtDimensionAccountingFlag>
		</ChildObjects>
	</ChartOfAccounts>
</MetaDataObject>

DataProcessors/ПроверкаЗаписейРегистраБухгалтерии/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПроверитьЗаписиВФоне(Параметры, АдресРезультата) Экспорт

	Результат = ПроверитьЗаписи(Параметры.Исправлять, Ложь);
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);

КонецПроцедуры

Процедура ИсправитьОтложенно(Параметры) Экспорт
	
	Результат = ПроверитьЗаписи(Истина, Истина);
	Параметры.ОбработкаЗавершена = Результат.ДокументыСОшибками.Количество() = 0;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьЗаписи(Исправлять, Отложенно)
	
	РезультатПроверки = Новый Структура;
	РезультатПроверки.Вставить("ДокументыСОшибками", Новый Массив);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	СчетаБУ.Ссылка КАК Счет
		|ПОМЕСТИТЬ СчетаБезПодразделений
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК СчетаБУ
		|ГДЕ
		|	НЕ СчетаБУ.УчетПоПодразделениям
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Счет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СчетаБУ.Ссылка КАК Счет
		|ПОМЕСТИТЬ СчетаБезВалют
		|ИЗ
		|	ПланСчетов.Хозрасчетный КАК СчетаБУ
		|ГДЕ
		|	НЕ СчетаБУ.Валютный
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Счет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Регистраторы.Ссылка КАК Ссылка,
		|	МАКСИМУМ(Регистраторы.Дата) КАК Дата
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|		Проводки.Период КАК Дата,
		|		Проводки.Регистратор КАК Ссылка
		|	ИЗ
		|		РегистрБухгалтерии.Хозрасчетный КАК Проводки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаБезПодразделений КАК СчетаБезПодразделений
		|			ПО Проводки.СчетДт = СчетаБезПодразделений.Счет
		|				И (Проводки.ПодразделениеДт ЕСТЬ НЕ NULL )
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|		Проводки.Период,
		|		Проводки.Регистратор
		|	ИЗ
		|		РегистрБухгалтерии.Хозрасчетный КАК Проводки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаБезПодразделений КАК СчетаБезПодразделений
		|			ПО Проводки.СчетКт = СчетаБезПодразделений.Счет
		|				И (Проводки.ПодразделениеКт ЕСТЬ НЕ NULL )
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|		Проводки.Период,
		|		Проводки.Регистратор
		|	ИЗ
		|		РегистрБухгалтерии.Хозрасчетный КАК Проводки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаБезВалют КАК СчетаБезВалют
		|			ПО Проводки.СчетДт = СчетаБезВалют.Счет
		|				И (Проводки.ВалютаДт ЕСТЬ НЕ NULL )
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000
		|		Проводки.Период,
		|		Проводки.Регистратор
		|	ИЗ
		|		РегистрБухгалтерии.Хозрасчетный КАК Проводки
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаБезВалют КАК СчетаБезВалют
		|			ПО Проводки.СчетКт = СчетаБезВалют.Счет
		|				И (Проводки.ВалютаКт ЕСТЬ НЕ NULL )) КАК Регистраторы
		|
		|СГРУППИРОВАТЬ ПО
		|	Регистраторы.Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Дата УБЫВ,
		|	Ссылка УБЫВ
		|;
		|ВЫБРАТЬ
		|СчетаБезПодразделений.Счет КАК Счет
		|ИЗ
		|СчетаБезПодразделений КАК СчетаБезПодразделений
		|;
		|ВЫБРАТЬ
		|СчетаБезВалют.Счет КАК Счет
		|ИЗ
		|СчетаБезВалют КАК СчетаБезВалют");
	Если Не Отложенно Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1000", "ВЫБРАТЬ РАЗЛИЧНЫЕ");
	КонецЕсли;
	
	Результат = Запрос.ВыполнитьПакет();
	ОсновнойРезультат = Результат[2];
	Если ОсновнойРезультат.Пустой() Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	СчетаБезПодразделений = Результат[3].Выгрузить().ВыгрузитьКолонку("Счет");
	СчетаБезВалют = Результат[4].Выгрузить().ВыгрузитьКолонку("Счет");
	
	Выборка = ОсновнойРезультат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		РезультатПроверки.ДокументыСОшибками.Добавить(Выборка.Ссылка);
		Если Не Исправлять Тогда
			Продолжить;
		КонецЕсли;
		
		Набор = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
		Набор.Отбор.Регистратор.Установить(Выборка.Ссылка);
		Набор.Прочитать();
		
		Для каждого Проводка Из Набор Цикл
			Если СчетаБезПодразделений.Найти(Проводка.СчетДт) <> Неопределено Тогда
				Проводка.ПодразделениеДт = Null;
			КонецЕсли;
			Если СчетаБезПодразделений.Найти(Проводка.СчетКт) <> Неопределено Тогда
				Проводка.ПодразделениеКт = Null;
			КонецЕсли;
			Если СчетаБезВалют.Найти(Проводка.СчетДт) <> Неопределено Тогда
				Проводка.ВалютаДт = Null;
			КонецЕсли;
			Если СчетаБезВалют.Найти(Проводка.СчетКт) <> Неопределено Тогда
				Проводка.ВалютаКт = Null;
			КонецЕсли;
		КонецЦикла;
		
		Набор.ОбменДанными.Загрузка = Истина; 
		Набор.Записать();
	
	КонецЦикла;
	
	Возврат РезультатПроверки;
	
КонецФункции

#КонецОбласти

#КонецЕсли
